zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/ip/cyip_sdhc.h
#define SDHC_CORE_CAPABILITIES1_R_BASE_CLK_FREQ_Msk 0xFF00UL
#define SDHC_CORE_CAPABILITIES1_R_MAX_BLK_LEN_Pos 16UL
#define SDHC_CORE_CAPABILITIES1_R_MAX_BLK_LEN_Msk 0x30000UL
#define SDHC_CORE_CAPABILITIES1_R_EMBEDDED_8_BIT_Pos 18UL
#define SDHC_CORE_CAPABILITIES1_R_EMBEDDED_8_BIT_Msk 0x40000UL
#define SDHC_CORE_CAPABILITIES1_R_ADMA2_SUPPORT_Pos 19UL
#define SDHC_CORE_CAPABILITIES1_R_ADMA2_SUPPORT_Msk 0x80000UL
#define SDHC_CORE_CAPABILITIES1_R_HIGH_SPEED_SUPPORT_Pos 21UL
#define SDHC_CORE_CAPABILITIES1_R_HIGH_SPEED_SUPPORT_Msk 0x200000UL
#define SDHC_CORE_CAPABILITIES1_R_SDMA_SUPPORT_Pos 22UL
#define SDHC_CORE_CAPABILITIES1_R_SDMA_SUPPORT_Msk 0x400000UL
#define SDHC_CORE_CAPABILITIES1_R_SUS_RES_SUPPORT_Pos 23UL
#define SDHC_CORE_CAPABILITIES1_R_SUS_RES_SUPPORT_Msk 0x800000UL
#define SDHC_CORE_CAPABILITIES1_R_VOLT_33_Pos   24UL
#define SDHC_CORE_CAPABILITIES1_R_VOLT_33_Msk   0x1000000UL
#define SDHC_CORE_CAPABILITIES1_R_VOLT_30_Pos   25UL
#define SDHC_CORE_CAPABILITIES1_R_VOLT_30_Msk   0x2000000UL
#define SDHC_CORE_CAPABILITIES1_R_VOLT_18_Pos   26UL
#define SDHC_CORE_CAPABILITIES1_R_VOLT_18_Msk   0x4000000UL
#define SDHC_CORE_CAPABILITIES1_R_SYS_ADDR_64_V4_Pos 27UL
#define SDHC_CORE_CAPABILITIES1_R_SYS_ADDR_64_V4_Msk 0x8000000UL
#define SDHC_CORE_CAPABILITIES1_R_SYS_ADDR_64_V3_Pos 28UL
#define SDHC_CORE_CAPABILITIES1_R_SYS_ADDR_64_V3_Msk 0x10000000UL
#define SDHC_CORE_CAPABILITIES1_R_ASYNC_INT_SUPPORT_Pos 29UL
#define SDHC_CORE_CAPABILITIES1_R_ASYNC_INT_SUPPORT_Msk 0x20000000UL
#define SDHC_CORE_CAPABILITIES1_R_SLOT_TYPE_R_Pos 30UL
#define SDHC_CORE_CAPABILITIES1_R_SLOT_TYPE_R_Msk 0xC0000000UL
/* SDHC_CORE.CAPABILITIES2_R */
#define SDHC_CORE_CAPABILITIES2_R_SDR50_SUPPORT_Pos 0UL
#define SDHC_CORE_CAPABILITIES2_R_SDR50_SUPPORT_Msk 0x1UL
#define SDHC_CORE_CAPABILITIES2_R_SDR104_SUPPORT_Pos 1UL
#define SDHC_CORE_CAPABILITIES2_R_SDR104_SUPPORT_Msk 0x2UL
#define SDHC_CORE_CAPABILITIES2_R_DDR50_SUPPORT_Pos 2UL
#define SDHC_CORE_CAPABILITIES2_R_DDR50_SUPPORT_Msk 0x4UL
#define SDHC_CORE_CAPABILITIES2_R_UHS2_SUPPORT_Pos 3UL
#define SDHC_CORE_CAPABILITIES2_R_UHS2_SUPPORT_Msk 0x8UL
#define SDHC_CORE_CAPABILITIES2_R_DRV_TYPEA_Pos 4UL
#define SDHC_CORE_CAPABILITIES2_R_DRV_TYPEA_Msk 0x10UL
#define SDHC_CORE_CAPABILITIES2_R_DRV_TYPEC_Pos 5UL
#define SDHC_CORE_CAPABILITIES2_R_DRV_TYPEC_Msk 0x20UL
#define SDHC_CORE_CAPABILITIES2_R_DRV_TYPED_Pos 6UL
#define SDHC_CORE_CAPABILITIES2_R_DRV_TYPED_Msk 0x40UL
#define SDHC_CORE_CAPABILITIES2_R_RETUNE_CNT_Pos 8UL
#define SDHC_CORE_CAPABILITIES2_R_RETUNE_CNT_Msk 0xF00UL
#define SDHC_CORE_CAPABILITIES2_R_USE_TUNING_SDR50_Pos 13UL
#define SDHC_CORE_CAPABILITIES2_R_USE_TUNING_SDR50_Msk 0x2000UL
#define SDHC_CORE_CAPABILITIES2_R_RE_TUNING_MODES_Pos 14UL
#define SDHC_CORE_CAPABILITIES2_R_RE_TUNING_MODES_Msk 0xC000UL
#define SDHC_CORE_CAPABILITIES2_R_CLK_MUL_Pos   16UL
#define SDHC_CORE_CAPABILITIES2_R_CLK_MUL_Msk   0xFF0000UL
#define SDHC_CORE_CAPABILITIES2_R_ADMA3_SUPPORT_Pos 27UL
#define SDHC_CORE_CAPABILITIES2_R_ADMA3_SUPPORT_Msk 0x8000000UL
#define SDHC_CORE_CAPABILITIES2_R_VDD2_18V_SUPPORT_Pos 28UL
#define SDHC_CORE_CAPABILITIES2_R_VDD2_18V_SUPPORT_Msk 0x10000000UL
/* SDHC_CORE.CURR_CAPABILITIES1_R */
#define SDHC_CORE_CURR_CAPABILITIES1_R_MAX_CUR_33V_Pos 0UL
#define SDHC_CORE_CURR_CAPABILITIES1_R_MAX_CUR_33V_Msk 0xFFUL
#define SDHC_CORE_CURR_CAPABILITIES1_R_MAX_CUR_30V_Pos 8UL
#define SDHC_CORE_CURR_CAPABILITIES1_R_MAX_CUR_30V_Msk 0xFF00UL
#define SDHC_CORE_CURR_CAPABILITIES1_R_MAX_CUR_18V_Pos 16UL
#define SDHC_CORE_CURR_CAPABILITIES1_R_MAX_CUR_18V_Msk 0xFF0000UL
/* SDHC_CORE.CURR_CAPABILITIES2_R */
#define SDHC_CORE_CURR_CAPABILITIES2_R_MAX_CUR_VDD2_18V_Pos 0UL
#define SDHC_CORE_CURR_CAPABILITIES2_R_MAX_CUR_VDD2_18V_Msk 0xFFUL
/* SDHC_CORE.FORCE_AUTO_CMD_STAT_R */
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_AUTO_CMD12_NOT_EXEC_Pos 0UL
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_AUTO_CMD12_NOT_EXEC_Msk 0x1UL
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_AUTO_CMD_TOUT_ERR_Pos 1UL
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_AUTO_CMD_TOUT_ERR_Msk 0x2UL
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_AUTO_CMD_CRC_ERR_Pos 2UL
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_AUTO_CMD_CRC_ERR_Msk 0x4UL
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_AUTO_CMD_EBIT_ERR_Pos 3UL
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_AUTO_CMD_EBIT_ERR_Msk 0x8UL
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_AUTO_CMD_IDX_ERR_Pos 4UL
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_AUTO_CMD_IDX_ERR_Msk 0x10UL
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_AUTO_CMD_RESP_ERR_Pos 5UL
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_AUTO_CMD_RESP_ERR_Msk 0x20UL
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_CMD_NOT_ISSUED_AUTO_CMD12_Pos 7UL
#define SDHC_CORE_FORCE_AUTO_CMD_STAT_R_FORCE_CMD_NOT_ISSUED_AUTO_CMD12_Msk 0x80UL
/* SDHC_CORE.FORCE_ERROR_INT_STAT_R */
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_CMD_TOUT_ERR_Pos 0UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_CMD_TOUT_ERR_Msk 0x1UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_CMD_CRC_ERR_Pos 1UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_CMD_CRC_ERR_Msk 0x2UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_CMD_END_BIT_ERR_Pos 2UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_CMD_END_BIT_ERR_Msk 0x4UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_CMD_IDX_ERR_Pos 3UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_CMD_IDX_ERR_Msk 0x8UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_DATA_TOUT_ERR_Pos 4UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_DATA_TOUT_ERR_Msk 0x10UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_DATA_CRC_ERR_Pos 5UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_DATA_CRC_ERR_Msk 0x20UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_DATA_END_BIT_ERR_Pos 6UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_DATA_END_BIT_ERR_Msk 0x40UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_CUR_LMT_ERR_Pos 7UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_CUR_LMT_ERR_Msk 0x80UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_AUTO_CMD_ERR_Pos 8UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_AUTO_CMD_ERR_Msk 0x100UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_ADMA_ERR_Pos 9UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_ADMA_ERR_Msk 0x200UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_TUNING_ERR_Pos 10UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_TUNING_ERR_Msk 0x400UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_RESP_ERR_Pos 11UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_RESP_ERR_Msk 0x800UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_BOOT_ACK_ERR_Pos 12UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_BOOT_ACK_ERR_Msk 0x1000UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_VENDOR_ERR1_Pos 13UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_VENDOR_ERR1_Msk 0x2000UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_VENDOR_ERR2_Pos 14UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_VENDOR_ERR2_Msk 0x4000UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_VENDOR_ERR3_Pos 15UL
#define SDHC_CORE_FORCE_ERROR_INT_STAT_R_FORCE_VENDOR_ERR3_Msk 0x8000UL
/* SDHC_CORE.ADMA_ERR_STAT_R */
#define SDHC_CORE_ADMA_ERR_STAT_R_ADMA_ERR_STATES_Pos 0UL
#define SDHC_CORE_ADMA_ERR_STAT_R_ADMA_ERR_STATES_Msk 0x3UL
#define SDHC_CORE_ADMA_ERR_STAT_R_ADMA_LEN_ERR_Pos 2UL
#define SDHC_CORE_ADMA_ERR_STAT_R_ADMA_LEN_ERR_Msk 0x4UL
/* SDHC_CORE.ADMA_SA_LOW_R */
#define SDHC_CORE_ADMA_SA_LOW_R_ADMA_SA_LOW_Pos 0UL
#define SDHC_CORE_ADMA_SA_LOW_R_ADMA_SA_LOW_Msk 0xFFFFFFFFUL
/* SDHC_CORE.PRESET_INIT_R */
#define SDHC_CORE_PRESET_INIT_R_FREQ_SEL_VAL_Pos 0UL
#define SDHC_CORE_PRESET_INIT_R_FREQ_SEL_VAL_Msk 0x3FFUL
#define SDHC_CORE_PRESET_INIT_R_CLK_GEN_SEL_VAL_Pos 10UL
#define SDHC_CORE_PRESET_INIT_R_CLK_GEN_SEL_VAL_Msk 0x400UL
#define SDHC_CORE_PRESET_INIT_R_DRV_SEL_VAL_Pos 14UL
#define SDHC_CORE_PRESET_INIT_R_DRV_SEL_VAL_Msk 0xC000UL
/* SDHC_CORE.PRESET_DS_R */
#define SDHC_CORE_PRESET_DS_R_FREQ_SEL_VAL_Pos  0UL
#define SDHC_CORE_PRESET_DS_R_FREQ_SEL_VAL_Msk  0x3FFUL
#define SDHC_CORE_PRESET_DS_R_CLK_GEN_SEL_VAL_Pos 10UL
#define SDHC_CORE_PRESET_DS_R_CLK_GEN_SEL_VAL_Msk 0x400UL
#define SDHC_CORE_PRESET_DS_R_DRV_SEL_VAL_Pos   14UL
#define SDHC_CORE_PRESET_DS_R_DRV_SEL_VAL_Msk   0xC000UL
/* SDHC_CORE.PRESET_HS_R */
#define SDHC_CORE_PRESET_HS_R_FREQ_SEL_VAL_Pos  0UL
#define SDHC_CORE_PRESET_HS_R_FREQ_SEL_VAL_Msk  0x3FFUL
#define SDHC_CORE_PRESET_HS_R_CLK_GEN_SEL_VAL_Pos 10UL
#define SDHC_CORE_PRESET_HS_R_CLK_GEN_SEL_VAL_Msk 0x400UL
#define SDHC_CORE_PRESET_HS_R_DRV_SEL_VAL_Pos   14UL
#define SDHC_CORE_PRESET_HS_R_DRV_SEL_VAL_Msk   0xC000UL
/* SDHC_CORE.PRESET_SDR12_R */
#define SDHC_CORE_PRESET_SDR12_R_FREQ_SEL_VAL_Pos 0UL
#define SDHC_CORE_PRESET_SDR12_R_FREQ_SEL_VAL_Msk 0x3FFUL
#define SDHC_CORE_PRESET_SDR12_R_CLK_GEN_SEL_VAL_Pos 10UL
#define SDHC_CORE_PRESET_SDR12_R_CLK_GEN_SEL_VAL_Msk 0x400UL
#define SDHC_CORE_PRESET_SDR12_R_DRV_SEL_VAL_Pos 14UL
#define SDHC_CORE_PRESET_SDR12_R_DRV_SEL_VAL_Msk 0xC000UL
/* SDHC_CORE.PRESET_SDR25_R */
#define SDHC_CORE_PRESET_SDR25_R_FREQ_SEL_VAL_Pos 0UL
#define SDHC_CORE_PRESET_SDR25_R_FREQ_SEL_VAL_Msk 0x3FFUL
#define SDHC_CORE_PRESET_SDR25_R_CLK_GEN_SEL_VAL_Pos 10UL
#define SDHC_CORE_PRESET_SDR25_R_CLK_GEN_SEL_VAL_Msk 0x400UL
#define SDHC_CORE_PRESET_SDR25_R_DRV_SEL_VAL_Pos 14UL
#define SDHC_CORE_PRESET_SDR25_R_DRV_SEL_VAL_Msk 0xC000UL
/* SDHC_CORE.PRESET_SDR50_R */
#define SDHC_CORE_PRESET_SDR50_R_FREQ_SEL_VAL_Pos 0UL
#define SDHC_CORE_PRESET_SDR50_R_FREQ_SEL_VAL_Msk 0x3FFUL
#define SDHC_CORE_PRESET_SDR50_R_CLK_GEN_SEL_VAL_Pos 10UL
#define SDHC_CORE_PRESET_SDR50_R_CLK_GEN_SEL_VAL_Msk 0x400UL
#define SDHC_CORE_PRESET_SDR50_R_DRV_SEL_VAL_Pos 14UL
#define SDHC_CORE_PRESET_SDR50_R_DRV_SEL_VAL_Msk 0xC000UL
/* SDHC_CORE.PRESET_SDR104_R */
#define SDHC_CORE_PRESET_SDR104_R_FREQ_SEL_VAL_Pos 0UL
#define SDHC_CORE_PRESET_SDR104_R_FREQ_SEL_VAL_Msk 0x3FFUL
#define SDHC_CORE_PRESET_SDR104_R_CLK_GEN_SEL_VAL_Pos 10UL
#define SDHC_CORE_PRESET_SDR104_R_CLK_GEN_SEL_VAL_Msk 0x400UL
#define SDHC_CORE_PRESET_SDR104_R_DRV_SEL_VAL_Pos 14UL
#define SDHC_CORE_PRESET_SDR104_R_DRV_SEL_VAL_Msk 0xC000UL
/* SDHC_CORE.PRESET_DDR50_R */
#define SDHC_CORE_PRESET_DDR50_R_FREQ_SEL_VAL_Pos 0UL
#define SDHC_CORE_PRESET_DDR50_R_FREQ_SEL_VAL_Msk 0x3FFUL
#define SDHC_CORE_PRESET_DDR50_R_CLK_GEN_SEL_VAL_Pos 10UL
#define SDHC_CORE_PRESET_DDR50_R_CLK_GEN_SEL_VAL_Msk 0x400UL
#define SDHC_CORE_PRESET_DDR50_R_DRV_SEL_VAL_Pos 14UL
#define SDHC_CORE_PRESET_DDR50_R_DRV_SEL_VAL_Msk 0xC000UL
/* SDHC_CORE.PRESET_UHS2_R */
#define SDHC_CORE_PRESET_UHS2_R_FREQ_SEL_VAL_Pos 0UL
#define SDHC_CORE_PRESET_UHS2_R_FREQ_SEL_VAL_Msk 0x3FFUL
#define SDHC_CORE_PRESET_UHS2_R_CLK_GEN_SEL_VAL_Pos 10UL
#define SDHC_CORE_PRESET_UHS2_R_CLK_GEN_SEL_VAL_Msk 0x400UL
#define SDHC_CORE_PRESET_UHS2_R_DRV_SEL_VAL_Pos 14UL
#define SDHC_CORE_PRESET_UHS2_R_DRV_SEL_VAL_Msk 0xC000UL
/* SDHC_CORE.ADMA_ID_LOW_R */
#define SDHC_CORE_ADMA_ID_LOW_R_ADMA_ID_LOW_Pos 0UL
#define SDHC_CORE_ADMA_ID_LOW_R_ADMA_ID_LOW_Msk 0xFFFFFFFFUL
/* SDHC_CORE.P_EMBEDDED_CNTRL */
#define SDHC_CORE_P_EMBEDDED_CNTRL_REG_OFFSET_ADDR_Pos 0UL
#define SDHC_CORE_P_EMBEDDED_CNTRL_REG_OFFSET_ADDR_Msk 0xFFFUL
/* SDHC_CORE.P_VENDOR_SPECIFIC_AREA */
#define SDHC_CORE_P_VENDOR_SPECIFIC_AREA_REG_OFFSET_ADDR_Pos 0UL
#define SDHC_CORE_P_VENDOR_SPECIFIC_AREA_REG_OFFSET_ADDR_Msk 0xFFFUL
/* SDHC_CORE.P_VENDOR2_SPECIFIC_AREA */
#define SDHC_CORE_P_VENDOR2_SPECIFIC_AREA_V2SA_REG_OFFSET_ADDR_Pos 0UL
#define SDHC_CORE_P_VENDOR2_SPECIFIC_AREA_V2SA_REG_OFFSET_ADDR_Msk 0xFFFFUL
/* SDHC_CORE.SLOT_INTR_STATUS_R */
#define SDHC_CORE_SLOT_INTR_STATUS_R_INTR_SLOT_Pos 0UL
#define SDHC_CORE_SLOT_INTR_STATUS_R_INTR_SLOT_Msk 0xFFUL
/* SDHC_CORE.HOST_CNTRL_VERS_R */
#define SDHC_CORE_HOST_CNTRL_VERS_R_SPEC_VERSION_NUM_Pos 0UL
#define SDHC_CORE_HOST_CNTRL_VERS_R_SPEC_VERSION_NUM_Msk 0xFFUL
#define SDHC_CORE_HOST_CNTRL_VERS_R_VENDOR_VERSION_NUM_Pos 8UL
#define SDHC_CORE_HOST_CNTRL_VERS_R_VENDOR_VERSION_NUM_Msk 0xFF00UL
/* SDHC_CORE.CQVER */
#define SDHC_CORE_CQVER_EMMC_VER_SUFFIX_Pos     0UL
#define SDHC_CORE_CQVER_EMMC_VER_SUFFIX_Msk     0xFUL
#define SDHC_CORE_CQVER_EMMC_VER_MINOR_Pos      4UL
#define SDHC_CORE_CQVER_EMMC_VER_MINOR_Msk      0xF0UL
#define SDHC_CORE_CQVER_EMMC_VER_MAJOR_Pos      8UL
#define SDHC_CORE_CQVER_EMMC_VER_MAJOR_Msk      0xF00UL
/* SDHC_CORE.CQCAP */
#define SDHC_CORE_CQCAP_ITCFVAL_Pos             0UL
#define SDHC_CORE_CQCAP_ITCFVAL_Msk             0x3FFUL
#define SDHC_CORE_CQCAP_ITCFMUL_Pos             12UL
#define SDHC_CORE_CQCAP_ITCFMUL_Msk             0xF000UL
#define SDHC_CORE_CQCAP_CRYPTO_SUPPORT_Pos      28UL
#define SDHC_CORE_CQCAP_CRYPTO_SUPPORT_Msk      0x10000000UL
/* SDHC_CORE.CQCFG */
#define SDHC_CORE_CQCFG_CQ_EN_Pos               0UL
#define SDHC_CORE_CQCFG_CQ_EN_Msk               0x1UL
#define SDHC_CORE_CQCFG_CR_GENERAL_EN_Pos       1UL
#define SDHC_CORE_CQCFG_CR_GENERAL_EN_Msk       0x2UL
#define SDHC_CORE_CQCFG_TASK_DESC_SIZE_Pos      8UL
#define SDHC_CORE_CQCFG_TASK_DESC_SIZE_Msk      0x100UL
#define SDHC_CORE_CQCFG_DCMD_EN_Pos             12UL
#define SDHC_CORE_CQCFG_DCMD_EN_Msk             0x1000UL
/* SDHC_CORE.CQCTL */
#define SDHC_CORE_CQCTL_HALT_Pos                0UL
#define SDHC_CORE_CQCTL_HALT_Msk                0x1UL
#define SDHC_CORE_CQCTL_CLR_ALL_TASKS_Pos       8UL
#define SDHC_CORE_CQCTL_CLR_ALL_TASKS_Msk       0x100UL
/* SDHC_CORE.CQIS */
#define SDHC_CORE_CQIS_HAC_Pos                  0UL
#define SDHC_CORE_CQIS_HAC_Msk                  0x1UL
#define SDHC_CORE_CQIS_TCC_Pos                  1UL
#define SDHC_CORE_CQIS_TCC_Msk                  0x2UL
#define SDHC_CORE_CQIS_RED_Pos                  2UL
#define SDHC_CORE_CQIS_RED_Msk                  0x4UL
#define SDHC_CORE_CQIS_TCL_Pos                  3UL
#define SDHC_CORE_CQIS_TCL_Msk                  0x8UL
#define SDHC_CORE_CQIS_GCE_Pos                  4UL
#define SDHC_CORE_CQIS_GCE_Msk                  0x10UL
#define SDHC_CORE_CQIS_ICCE_Pos                 5UL
#define SDHC_CORE_CQIS_ICCE_Msk                 0x20UL
/* SDHC_CORE.CQISE */
#define SDHC_CORE_CQISE_HAC_STE_Pos             0UL
#define SDHC_CORE_CQISE_HAC_STE_Msk             0x1UL
#define SDHC_CORE_CQISE_TCC_STE_Pos             1UL
#define SDHC_CORE_CQISE_TCC_STE_Msk             0x2UL
#define SDHC_CORE_CQISE_RED_STE_Pos             2UL
#define SDHC_CORE_CQISE_RED_STE_Msk             0x4UL
#define SDHC_CORE_CQISE_TCL_STE_Pos             3UL
#define SDHC_CORE_CQISE_TCL_STE_Msk             0x8UL
#define SDHC_CORE_CQISE_GCE_STE_Pos             4UL
#define SDHC_CORE_CQISE_GCE_STE_Msk             0x10UL
#define SDHC_CORE_CQISE_ICCE_STE_Pos            5UL
#define SDHC_CORE_CQISE_ICCE_STE_Msk            0x20UL
/* SDHC_CORE.CQISGE */
#define SDHC_CORE_CQISGE_HAC_SGE_Pos            0UL
#define SDHC_CORE_CQISGE_HAC_SGE_Msk            0x1UL
#define SDHC_CORE_CQISGE_TCC_SGE_Pos            1UL
#define SDHC_CORE_CQISGE_TCC_SGE_Msk            0x2UL
#define SDHC_CORE_CQISGE_RED_SGE_Pos            2UL
#define SDHC_CORE_CQISGE_RED_SGE_Msk            0x4UL
#define SDHC_CORE_CQISGE_TCL_SGE_Pos            3UL
#define SDHC_CORE_CQISGE_TCL_SGE_Msk            0x8UL
#define SDHC_CORE_CQISGE_GCE_SGE_Pos            4UL
#define SDHC_CORE_CQISGE_GCE_SGE_Msk            0x10UL
#define SDHC_CORE_CQISGE_ICCE_SGE_Pos           5UL
#define SDHC_CORE_CQISGE_ICCE_SGE_Msk           0x20UL
/* SDHC_CORE.CQIC */
#define SDHC_CORE_CQIC_TOUT_VAL_Pos             0UL
#define SDHC_CORE_CQIC_TOUT_VAL_Msk             0x7FUL
#define SDHC_CORE_CQIC_TOUT_VAL_WEN_Pos         7UL
#define SDHC_CORE_CQIC_TOUT_VAL_WEN_Msk         0x80UL
#define SDHC_CORE_CQIC_INTC_TH_Pos              8UL
#define SDHC_CORE_CQIC_INTC_TH_Msk              0x1F00UL
#define SDHC_CORE_CQIC_INTC_TH_WEN_Pos          15UL
#define SDHC_CORE_CQIC_INTC_TH_WEN_Msk          0x8000UL
#define SDHC_CORE_CQIC_INTC_RST_Pos             16UL
#define SDHC_CORE_CQIC_INTC_RST_Msk             0x10000UL
#define SDHC_CORE_CQIC_INTC_STAT_Pos            20UL
#define SDHC_CORE_CQIC_INTC_STAT_Msk            0x100000UL
#define SDHC_CORE_CQIC_INTC_EN_Pos              31UL
#define SDHC_CORE_CQIC_INTC_EN_Msk              0x80000000UL
/* SDHC_CORE.CQTDLBA */
#define SDHC_CORE_CQTDLBA_TDLBA_Pos             0UL
#define SDHC_CORE_CQTDLBA_TDLBA_Msk             0xFFFFFFFFUL
/* SDHC_CORE.CQTDBR */
#define SDHC_CORE_CQTDBR_DBR_Pos                0UL
#define SDHC_CORE_CQTDBR_DBR_Msk                0xFFFFFFFFUL
/* SDHC_CORE.CQTCN */
#define SDHC_CORE_CQTCN_TCN_Pos                 0UL
#define SDHC_CORE_CQTCN_TCN_Msk                 0xFFFFFFFFUL
/* SDHC_CORE.CQDQS */
#define SDHC_CORE_CQDQS_DQS_Pos                 0UL
#define SDHC_CORE_CQDQS_DQS_Msk                 0xFFFFFFFFUL
/* SDHC_CORE.CQDPT */
#define SDHC_CORE_CQDPT_DPT_Pos                 0UL
#define SDHC_CORE_CQDPT_DPT_Msk                 0xFFFFFFFFUL
/* SDHC_CORE.CQTCLR */
#define SDHC_CORE_CQTCLR_TCLR_Pos               0UL
#define SDHC_CORE_CQTCLR_TCLR_Msk               0xFFFFFFFFUL
/* SDHC_CORE.CQSSC1 */
#define SDHC_CORE_CQSSC1_SQSCMD_IDLE_TMR_Pos    0UL
#define SDHC_CORE_CQSSC1_SQSCMD_IDLE_TMR_Msk    0xFFFFUL
#define SDHC_CORE_CQSSC1_SQSCMD_BLK_CNT_Pos     16UL
#define SDHC_CORE_CQSSC1_SQSCMD_BLK_CNT_Msk     0xF0000UL
/* SDHC_CORE.CQSSC2 */
#define SDHC_CORE_CQSSC2_SQSCMD_RCA_Pos         0UL
#define SDHC_CORE_CQSSC2_SQSCMD_RCA_Msk         0xFFFFUL
/* SDHC_CORE.CQCRDCT */
#define SDHC_CORE_CQCRDCT_DCMD_RESP_Pos         0UL
#define SDHC_CORE_CQCRDCT_DCMD_RESP_Msk         0xFFFFFFFFUL
/* SDHC_CORE.CQRMEM */
#define SDHC_CORE_CQRMEM_RESP_ERR_MASK_Pos      0UL
#define SDHC_CORE_CQRMEM_RESP_ERR_MASK_Msk      0xFFFFFFFFUL
/* SDHC_CORE.CQTERRI */
#define SDHC_CORE_CQTERRI_RESP_ERR_CMD_INDX_Pos 0UL
#define SDHC_CORE_CQTERRI_RESP_ERR_CMD_INDX_Msk 0x3FUL
#define SDHC_CORE_CQTERRI_RESP_ERR_TASKID_Pos   8UL
#define SDHC_CORE_CQTERRI_RESP_ERR_TASKID_Msk   0x1F00UL
#define SDHC_CORE_CQTERRI_RESP_ERR_FIELDS_VALID_Pos 15UL
#define SDHC_CORE_CQTERRI_RESP_ERR_FIELDS_VALID_Msk 0x8000UL
#define SDHC_CORE_CQTERRI_TRANS_ERR_CMD_INDX_Pos 16UL
#define SDHC_CORE_CQTERRI_TRANS_ERR_CMD_INDX_Msk 0x3F0000UL
#define SDHC_CORE_CQTERRI_TRANS_ERR_TASKID_Pos  24UL
#define SDHC_CORE_CQTERRI_TRANS_ERR_TASKID_Msk  0x1F000000UL
#define SDHC_CORE_CQTERRI_TRANS_ERR_FIELDS_VALID_Pos 31UL
#define SDHC_CORE_CQTERRI_TRANS_ERR_FIELDS_VALID_Msk 0x80000000UL
/* SDHC_CORE.CQCRI */
#define SDHC_CORE_CQCRI_CMD_RESP_INDX_Pos       0UL
#define SDHC_CORE_CQCRI_CMD_RESP_INDX_Msk       0x3FUL
/* SDHC_CORE.CQCRA */
#define SDHC_CORE_CQCRA_CMD_RESP_ARG_Pos        0UL
#define SDHC_CORE_CQCRA_CMD_RESP_ARG_Msk        0xFFFFFFFFUL
/* SDHC_CORE.MSHC_VER_ID_R */
#define SDHC_CORE_MSHC_VER_ID_R_MSHC_VER_ID_Pos 0UL
#define SDHC_CORE_MSHC_VER_ID_R_MSHC_VER_ID_Msk 0xFFFFFFFFUL
/* SDHC_CORE.MSHC_VER_TYPE_R */
#define SDHC_CORE_MSHC_VER_TYPE_R_MSHC_VER_TYPE_Pos 0UL
#define SDHC_CORE_MSHC_VER_TYPE_R_MSHC_VER_TYPE_Msk 0xFFFFFFFFUL
/* SDHC_CORE.MSHC_CTRL_R */
#define SDHC_CORE_MSHC_CTRL_R_CMD_CONFLICT_CHECK_Pos 0UL
#define SDHC_CORE_MSHC_CTRL_R_CMD_CONFLICT_CHECK_Msk 0x1UL
#define SDHC_CORE_MSHC_CTRL_R_SW_CG_DIS_Pos     4UL
#define SDHC_CORE_MSHC_CTRL_R_SW_CG_DIS_Msk     0x10UL
/* SDHC_CORE.MBIU_CTRL_R */
#define SDHC_CORE_MBIU_CTRL_R_UNDEFL_INCR_EN_Pos 0UL
#define SDHC_CORE_MBIU_CTRL_R_UNDEFL_INCR_EN_Msk 0x1UL
#define SDHC_CORE_MBIU_CTRL_R_BURST_INCR4_EN_Pos 1UL
#define SDHC_CORE_MBIU_CTRL_R_BURST_INCR4_EN_Msk 0x2UL
#define SDHC_CORE_MBIU_CTRL_R_BURST_INCR8_EN_Pos 2UL
#define SDHC_CORE_MBIU_CTRL_R_BURST_INCR8_EN_Msk 0x4UL
#define SDHC_CORE_MBIU_CTRL_R_BURST_INCR16_EN_Pos 3UL
#define SDHC_CORE_MBIU_CTRL_R_BURST_INCR16_EN_Msk 0x8UL
/* SDHC_CORE.EMMC_CTRL_R */
#define SDHC_CORE_EMMC_CTRL_R_CARD_IS_EMMC_Pos  0UL
#define SDHC_CORE_EMMC_CTRL_R_CARD_IS_EMMC_Msk  0x1UL
#define SDHC_CORE_EMMC_CTRL_R_DISABLE_DATA_CRC_CHK_Pos 1UL
#define SDHC_CORE_EMMC_CTRL_R_DISABLE_DATA_CRC_CHK_Msk 0x2UL
#define SDHC_CORE_EMMC_CTRL_R_EMMC_RST_N_Pos    2UL
#define SDHC_CORE_EMMC_CTRL_R_EMMC_RST_N_Msk    0x4UL
#define SDHC_CORE_EMMC_CTRL_R_EMMC_RST_N_OE_Pos 3UL
#define SDHC_CORE_EMMC_CTRL_R_EMMC_RST_N_OE_Msk 0x8UL
#define SDHC_CORE_EMMC_CTRL_R_CQE_ALGO_SEL_Pos  9UL
#define SDHC_CORE_EMMC_CTRL_R_CQE_ALGO_SEL_Msk  0x200UL
#define SDHC_CORE_EMMC_CTRL_R_CQE_PREFETCH_DISABLE_Pos 10UL
#define SDHC_CORE_EMMC_CTRL_R_CQE_PREFETCH_DISABLE_Msk 0x400UL
/* SDHC_CORE.BOOT_CTRL_R */
#define SDHC_CORE_BOOT_CTRL_R_MAN_BOOT_EN_Pos   0UL
#define SDHC_CORE_BOOT_CTRL_R_MAN_BOOT_EN_Msk   0x1UL
#define SDHC_CORE_BOOT_CTRL_R_VALIDATE_BOOT_Pos 7UL
#define SDHC_CORE_BOOT_CTRL_R_VALIDATE_BOOT_Msk 0x80UL
#define SDHC_CORE_BOOT_CTRL_R_BOOT_ACK_ENABLE_Pos 8UL
#define SDHC_CORE_BOOT_CTRL_R_BOOT_ACK_ENABLE_Msk 0x100UL
#define SDHC_CORE_BOOT_CTRL_R_BOOT_TOUT_CNT_Pos 12UL
#define SDHC_CORE_BOOT_CTRL_R_BOOT_TOUT_CNT_Msk 0xF000UL
/* SDHC_CORE.GP_IN_R */
#define SDHC_CORE_GP_IN_R_GP_IN_Pos             0UL
#define SDHC_CORE_GP_IN_R_GP_IN_Msk             0x1UL
/* SDHC_CORE.GP_OUT_R */
#define SDHC_CORE_GP_OUT_R_CARD_DETECT_EN_Pos   0UL
#define SDHC_CORE_GP_OUT_R_CARD_DETECT_EN_Msk   0x1UL
#define SDHC_CORE_GP_OUT_R_CARD_MECH_WRITE_PROT_EN_Pos 1UL
#define SDHC_CORE_GP_OUT_R_CARD_MECH_WRITE_PROT_EN_Msk 0x2UL
#define SDHC_CORE_GP_OUT_R_LED_CTRL_OE_Pos      2UL
#define SDHC_CORE_GP_OUT_R_LED_CTRL_OE_Msk      0x4UL
#define SDHC_CORE_GP_OUT_R_CARD_CLOCK_OE_Pos    3UL
#define SDHC_CORE_GP_OUT_R_CARD_CLOCK_OE_Msk    0x8UL
#define SDHC_CORE_GP_OUT_R_CARD_IF_PWR_EN_OE_Pos 4UL
#define SDHC_CORE_GP_OUT_R_CARD_IF_PWR_EN_OE_Msk 0x10UL
#define SDHC_CORE_GP_OUT_R_IO_VOLT_SEL_OE_Pos   5UL
#define SDHC_CORE_GP_OUT_R_IO_VOLT_SEL_OE_Msk   0x20UL
#define SDHC_CORE_GP_OUT_R_CARD_CLOCK_OUT_DLY_Pos 6UL
#define SDHC_CORE_GP_OUT_R_CARD_CLOCK_OUT_DLY_Msk 0xC0UL
#define SDHC_CORE_GP_OUT_R_CARD_CLOCK_IN_DLY_Pos 8UL
#define SDHC_CORE_GP_OUT_R_CARD_CLOCK_IN_DLY_Msk 0x300UL
/* SDHC_CORE.AT_CTRL_R */
#define SDHC_CORE_AT_CTRL_R_AT_EN_Pos           0UL
#define SDHC_CORE_AT_CTRL_R_AT_EN_Msk           0x1UL
#define SDHC_CORE_AT_CTRL_R_CI_SEL_Pos          1UL
#define SDHC_CORE_AT_CTRL_R_CI_SEL_Msk          0x2UL
#define SDHC_CORE_AT_CTRL_R_SWIN_TH_EN_Pos      2UL
#define SDHC_CORE_AT_CTRL_R_SWIN_TH_EN_Msk      0x4UL
#define SDHC_CORE_AT_CTRL_R_RPT_TUNE_ERR_Pos    3UL
#define SDHC_CORE_AT_CTRL_R_RPT_TUNE_ERR_Msk    0x8UL
#define SDHC_CORE_AT_CTRL_R_SW_TUNE_EN_Pos      4UL
#define SDHC_CORE_AT_CTRL_R_SW_TUNE_EN_Msk      0x10UL
#define SDHC_CORE_AT_CTRL_R_WIN_EDGE_SEL_Pos    8UL
#define SDHC_CORE_AT_CTRL_R_WIN_EDGE_SEL_Msk    0xF00UL
#define SDHC_CORE_AT_CTRL_R_TUNE_CLK_STOP_EN_Pos 16UL
#define SDHC_CORE_AT_CTRL_R_TUNE_CLK_STOP_EN_Msk 0x10000UL
#define SDHC_CORE_AT_CTRL_R_PRE_CHANGE_DLY_Pos  17UL
#define SDHC_CORE_AT_CTRL_R_PRE_CHANGE_DLY_Msk  0x60000UL
#define SDHC_CORE_AT_CTRL_R_POST_CHANGE_DLY_Pos 19UL
#define SDHC_CORE_AT_CTRL_R_POST_CHANGE_DLY_Msk 0x180000UL
#define SDHC_CORE_AT_CTRL_R_SWIN_TH_VAL_Pos     24UL
#define SDHC_CORE_AT_CTRL_R_SWIN_TH_VAL_Msk     0xFF000000UL
/* SDHC_CORE.AT_STAT_R */
#define SDHC_CORE_AT_STAT_R_CENTER_PH_CODE_Pos  0UL
#define SDHC_CORE_AT_STAT_R_CENTER_PH_CODE_Msk  0xFFUL
#define SDHC_CORE_AT_STAT_R_R_EDGE_PH_CODE_Pos  8UL
#define SDHC_CORE_AT_STAT_R_R_EDGE_PH_CODE_Msk  0xFF00UL
#define SDHC_CORE_AT_STAT_R_L_EDGE_PH_CODE_Pos  16UL
#define SDHC_CORE_AT_STAT_R_L_EDGE_PH_CODE_Msk  0xFF0000UL
/* SDHC_CORE.EMBEDDED_CTRL_R */
#define SDHC_CORE_EMBEDDED_CTRL_R_NUM_CLK_PIN_Pos 0UL
#define SDHC_CORE_EMBEDDED_CTRL_R_NUM_CLK_PIN_Msk 0x7UL
#define SDHC_CORE_EMBEDDED_CTRL_R_NUM_INT_PIN_Pos 4UL
#define SDHC_CORE_EMBEDDED_CTRL_R_NUM_INT_PIN_Msk 0x30UL
#define SDHC_CORE_EMBEDDED_CTRL_R_BUS_WIDTH_PRESET_Pos 8UL
#define SDHC_CORE_EMBEDDED_CTRL_R_BUS_WIDTH_PRESET_Msk 0x7F00UL
#define SDHC_CORE_EMBEDDED_CTRL_R_CLK_PIN_SEL_Pos 16UL
#define SDHC_CORE_EMBEDDED_CTRL_R_CLK_PIN_SEL_Msk 0x70000UL
#define SDHC_CORE_EMBEDDED_CTRL_R_INT_PIN_SEL_Pos 20UL
#define SDHC_CORE_EMBEDDED_CTRL_R_INT_PIN_SEL_Msk 0x700000UL
#define SDHC_CORE_EMBEDDED_CTRL_R_BACK_END_PWR_CTRL_Pos 24UL
#define SDHC_CORE_EMBEDDED_CTRL_R_BACK_END_PWR_CTRL_Msk 0x7F000000UL


#endif /* _CYIP_SDHC_H_ */


/* [] END OF FILE */
